import React from "react";
import styled from "styled-components";

const Container = styled.div`
  text-align: right;
  padding: 30px 40px 50px 180px;
  margin: 10px 20px;
  @media (max-width: 640px) {
    padding: 10px 10px;
    margin: 10px 10px;
  }
`;

const PrivacyPolicy = () => {
  return (
    <Container>
      <h2>מדיניות פרטיות</h2>
      <h4>כללי</h4>
      <p>
        אנו מחויבים להגן על הפרטיות והנתונים האישיים שלך. מדיניות פרטיות זו
        מסבירה כיצד אנו אוספים, משתמשים, משתפים ומגנים על המידע שלך כאשר אתה
        משתמש בפלטפורמה שלנו להשכרת אופניים וקורקינט פרטיים . על ידי גישה או
        שימוש בשירותים שלנו, אתה מסכים לשיטות המתוארות במדיניות פרטיות זו
      </p>
      <h4>מידע אישי</h4>
      <p>
        אנו עשויים לאסוף מידע אישי כגון שמך, כתובת הדוא"ל, מספר הטלפון ופרטי
        התשלום שלך כאשר אתה יוצר חשבון, מבצע הזמנה או מתקשר איתנו
      </p>
      <h4>מידע על השכרה</h4>
      <p>
        אנו אוספים מידע על ההשכרות שאתה מבצע, כולל משך ההשכרה, המיקום וסוג הכלי
        המושכר
      </p>
      <h4>נתוני שימוש</h4>
      <p>
        אנו אוספים מידע על האופן שבו אתה משתמש בשירותים שלנו, כולל האינטראקציות
        שלך עם הפלטפורמה, חיפושים ודפים שבהם ביקרת
      </p>
      <h4>פרטי חשבון</h4>
      <p>תוכל לגשת ולעדכן את פרטי החשבון שלך על ידי כניסה להגדרות החשבון שלך</p>
      <h4>כתב ויתור על השכרה</h4>
      <p>
        אנו רוצים להבהיר ש-שיר אנד רייד אינה לוקחת אחריות על כל גניבה, נזק,
        אובדן או נזק שעלולים להתרחש במהלך השימוש באופניים וקורקינט שכורים. בעוד
        אנו שואפים להציע פלטפורמה בטוחה ואמינה, הבעלות, התחזוקה והמצב של הרכבים
        המושכרים הם באחריותם הבלעדית של בעלי הרכב. המשתמשים בפלטפורמה שלנו
        מקבלים אחריות מלאה על האינטראקציות והעסקאות שלהם עם משתמשים אחרים ועל
        השימוש בכלי התחבורה השכורים
      </p>
    </Container>
  );
};

export default PrivacyPolicy;
